{
    "_default": {
        "1": {
            "post_id": "22awe3",
            "title": "Some title"
        },
        "2": {
            "post_id": "szdasdasd",
            "title": "Some other title"
        },
        "3": {
            "url": "https://youtu.be/dVZ9bPRTiIA?si=xzOY28hh6Q_ywWH1",
            "url_attr": "https://youtu.be/dVZ9bPRTiIA?si=xzOY28hh6Q_ywWH1",
            "title": "A proof how the unexplained can start a religion : the cargo cult",
            "body": null,
            "permalink": "https://www.reddit.com//r/exmuslim/comments/170jhtj/a_proof_how_the_unexplained_can_start_a_religion/",
            "reddit_id": "t3_170jhtj",
            "flair": "(Question/Discussion) ",
            "is_video": false,
            "is_pinned": null,
            "is_nswf": false,
            "is_poll": false,
            "is_locked": false
        },
        "4": {
            "url": null,
            "url_attr": "https://www.reddit.com/r/exmuslim/comments/170jhq3/told_my_parents_i_was_getting_married_to_a_non/",
            "title": "Told my parents I was getting married to a non Muslim, they did not take it well",
            "body": "I am a woman so that’s why they are upset, two women in my family have done this and the whole family talks really badly about them all the time(my dad especially and I had a huge fight about it when I was like 15 and I told him that they were adults and could do what they wanted) My male cousin did it and no one said anything(ofc it’s halal for him after all) \nMy parents both live in the Middle East, I’m in the US at the moment. My relationship with my dad has never been good anyway and I did expect him to say and insinuate all the things he did but my mom is upset and I don’t want my mom to be sad.  \n\nDid anyone go through a similar situation? Did they come around eventually? I can’t keep living the rest of my life as a double life and hiding it. Should I have kept it a secret?",
            "permalink": "https://www.reddit.com//r/exmuslim/comments/170jhq3/told_my_parents_i_was_getting_married_to_a_non/",
            "reddit_id": "t3_170jhq3",
            "flair": "(Advice/Help)",
            "is_video": false,
            "is_pinned": null,
            "is_nswf": false,
            "is_poll": false,
            "is_locked": false
        },
        "5": {
            "url": null,
            "url_attr": "https://www.reddit.com/r/exmuslim/comments/170j447/one_of_the_multiple_reasons_why_i_turned_into_a/",
            "title": "One of the multiple reasons why I turned into a atheist",
            "body": "Being a Muslim myself, I felt that marrying that 6 year old girl was ok because of considering what he provided the reason of his marriage that it would be used to spread Islam in women and blah blah .... But the main fuked up thing comes when he literally have sex with that girl when she turns 9 year old and for fucksake she wasn't even mature at that time that she can bear child and it is in our hadith, that no child came from that 9 year old girl in her whole lifetime..... So why the fuck that old man had sex with that 9 year old... How could it probably help Islam to be spread..... I'm done",
            "permalink": "https://www.reddit.com//r/exmuslim/comments/170j447/one_of_the_multiple_reasons_why_i_turned_into_a/",
            "reddit_id": "t3_170j447",
            "flair": "(Quran / Hadith)",
            "is_video": false,
            "is_pinned": null,
            "is_nswf": false,
            "is_poll": false,
            "is_locked": false
        },
        "6": {
            "url": null,
            "url_attr": "https://www.reddit.com/r/exmuslim/comments/170khbu/satanic_verses/",
            "title": "Satanic Verses?",
            "body": "What does everybody here think about the Satanic verses? Are they true or fabricated?",
            "permalink": "https://www.reddit.com//r/exmuslim/comments/170khbu/satanic_verses/",
            "reddit_id": "t3_170khbu",
            "flair": "(Question/Discussion) ",
            "is_video": false,
            "is_pinned": false,
            "is_nswf": false,
            "is_poll": false,
            "is_locked": false
        },
        "7": {
            "url": null,
            "url_attr": "https://www.reddit.com/r/exmuslim/comments/170j36i/dealing_with_the_emotions_of_moving_out/",
            "title": "Dealing with the emotions of moving out",
            "body": "\nThe day i move out is finally arriving. I have everything ready and I’ll be leaving to another country completely, to study. They don’t know yet and I definitely don’t plan on telling them. I’m really excited to finally live life on my own terms but I also feel extremely anxious and sad. I know I’ll be breaking my dad’s heart specifically and it’s hurting me. I know this is the right decision for me because if I stay, it means getting pressured into an arranged marriage (im a South Asian F in her late 20s) and even if I somehow dodge arranged marriage, my relationship with them is getting extremely strained and worse by the day. Yet, I feel guilty and selfish. I’m also leaving my job with no notice because I don’t want word getting out in advance. I want to try and rebuild my relationship with them eventually or at least retain my relationship with my sibling. Should I tell them which country I move to without giving any specific details about whereabouts? Or do I keep it vague like “I’m in Europe”? \n\nAny words of advice or motivation would really help…",
            "permalink": "https://www.reddit.com//r/exmuslim/comments/170j36i/dealing_with_the_emotions_of_moving_out/",
            "reddit_id": "t3_170j36i",
            "flair": "(Advice/Help)",
            "is_video": false,
            "is_pinned": false,
            "is_nswf": false,
            "is_poll": false,
            "is_locked": false
        }
    }
}